const Recipe = () => {
    return(
      <>
       <h1>Сырники домашние - рецепт</h1>
       
     <img 
      src="https://www.gastronom.ru/binfiles/images/20191112/b08f9d3a.jpg"
      alt="Сырники"
      />
       <div class='ingredient'>
       <h3>
       ИНГРЕДИЕНТЫ
       </h3>
       <ul>
         <li>творог – 200 г</li>
         <li>сахар – 1 ст. л.</li>
         <li>соль – на кончике ножа</li>
         <li>ванильный сахар – 1 ч. л.</li>
         <li>яйцо – 1 шт.</li>
         <li>мука – 1-2 ст. л. + 2-4 ст. л. для раскатывания теста и панировки сырников</li>
         <li>растительное масло – 2-3 ст. л</li>
       </ul>
       </div>
       <div class='step'>
       <div class='stepOne'>
       <h3>Шаг 1</h3>
       <p>Приготовьте тесто для домашних сырников. Для этого творог протрите через частое сито в миску. Если творог слишком влажный, откиньте его на марлю, сложенную вчетверо, и отожмите.</p>
       </div>
       <div class='stepOne'>
       <h3>Шаг 2</h3>
       <p>В миску с творогом добавьте обычный и ванильный сахар, а также соль. Перемешайте.</p>
       </div>
       <div class='stepOne'>
       <h3>Шаг 3</h3>
       <p>Яйцо взбейте венчиком. Добавьте в творожную массу и перемешайте лопаточкой или вилкой.</p>
       </div>
       <div class='stepOne'>
       <h3>Шаг 4</h3>
       <p>В творожную массу всыпьте муку. Перемешивайте лопаточкой до получения теста однородной гладкой консистенции. Миску с тестом для сырников уберите на 15 минут в холодильник.</p>
       </div>
       <div class='stepOne'>
       <h3>Шаг 5</h3>
       <p>Стол присыпьте мукой. Выложите творожное тесто для домашних сырников и сформируйте из него толстую колбаску диаметром примерно 5 см. Если муку недостаточно, добавьте еще немного и перемешайте.</p>
       </div>
       <div class='stepOne'>
       <h3>Шаг 6</h3>
       <p>Получившуюся «колбаску» нарежьте кружочками толщиной не более 1,5 см. Каждый обваляйте в муке и оставьте на столе, присыпанном мукой, до использования.</p>
       </div>
       <div class='stepOne'>
       <h3>Шаг 7</h3>
       <p>В большой сковороде диаметром 24-26 см хорошо нагрейте растительное масло. Выложите в нее сырники и жарьте по 2 минуты с каждой стороны до румяной корочки.</p>
       </div>
       <div class='stepOne'>
       <h3>Шаг 8</h3>
       <p>Сковороду с домашними сырниками накройте крышкой и держите на слабом огне 3 минуты. На стол подайте горячими, дополнив сметаной, сгущенным молоком, вареньем или джемом.</p>
       </div>
       
       </div>
      </>
    )
   }
 
 
 
 
 export default Recipe;